In [52]:
import pandas as pd
import numpy as np
import requests
import json

In [53]:
df = pd.read_csv('user.csv',index_col = 'job_id')
df.head()

                                     key  ... userfeedback
job_id                                    ...
26                None_Ackermanville_213  ...            0
1                      None_Abington_201  ...            1
1                        None_Nemours_72  ...            0
42      marten_transport_Morton_Grove_42  ...            1
91                       None_Shields_95  ...            0

[5 rows x 7 columns]

In [54]:
np.random.randint(11,size = 10)

array([10,  8,  2,  4,  8,  3,  0,  4,  0,  0])

In [55]:
neg = np.random.randint(11,size=len(df))
print(neg)
print(len(neg))

[ 2  7  7  9  1  7  5  9  9  8  7  3  1  6  0  0  4  0  5  2  3  5  2  3
  2  4  8 10  1  7  8  5  4  3  5 10 10  9 10  4  5  4 10  8  2  5  0 10
  2  7  4  2  7  1  6  0  7  0  2  0  1  0  3  9  0  5 10  7  6  3  2  5
  7  5  7  4  0  8  1  7  5  2  2  7  5  0  0  4  1  5  2  4  4 10  0  8
  7  5  3  0  8  7  3  8  1  4  9  8  0  6  1  6  0  3  5  3  8  2  9  1
  1 10  9  3  2  2  8  6  2  2  4  7  1  3  3  0  5  2  5  2  5 10  7 10
  6  4  7 10  7  6  2  2 10 10  3  2  9]
157

In [98]:
df['negative'] = neg
df.head()

                                     key      city_name  ...  percentage dummy
job_id                                                   ...
26                None_Ackermanville_213  Ackermanville  ...   60.000000     2
1                      None_Abington_201       Abington  ...   56.250000     2
1                        None_Nemours_72        Nemours  ...    0.000000     2
42      marten_transport_Morton_Grove_42   Morton Grove  ...   52.631579     2
91                       None_Shields_95        Shields  ...   87.500000     2

[5 rows x 11 columns]

In [96]:
df['dummy'] = np.random.randint(11)

In [58]:
df.head()

                                     key      city_name  ...  negative dummy
job_id                                                   ...
26                None_Ackermanville_213  Ackermanville  ...         2     2
1                      None_Abington_201       Abington  ...         7     2
1                        None_Nemours_72        Nemours  ...         7     2
42      marten_transport_Morton_Grove_42   Morton Grove  ...         9     2
91                       None_Shields_95        Shields  ...         1     2

[5 rows x 9 columns]

In [59]:
pos = np.random.randint(11,size = len(df))
print(pos)
print(len(pos))

[ 3  9  0 10  7  7  9  8  3  5  2  5  1  3  7  4  2 10  6  1  0  6  8  6
  0 10  8  0  8  5  4  5 10  6  1 10  0  1  1  1 10  4  5  7  5  3 10  0
  1  9 10  4  0  5  8  6  1  8  9  1  1  4  1  5 10  0  4  1 10  2 10  9
  0  3  3  1  6  0  2  1  9  4  1  6  1  4  7  3  5  6  9  1  8  8  4 10
 10  2  7  1 10  3 10  2  9  0  5  4  7  8  3  6  8  0  4  1  8  5  0  0
  7  3  8  0 10  1  3  0  9  1  1  2  6  5  5  7  2  4  4 10  3  1  9  5
  9  3 10  5  9  2  0  4  4  0  2  7  5]
157

In [60]:
df['positive'] = pos
df.head()

                                     key      city_name  ...  dummy positive
job_id                                                   ...
26                None_Ackermanville_213  Ackermanville  ...      2        3
1                      None_Abington_201       Abington  ...      2        9
1                        None_Nemours_72        Nemours  ...      2        0
42      marten_transport_Morton_Grove_42   Morton Grove  ...      2       10
91                       None_Shields_95        Shields  ...      2        7

[5 rows x 10 columns]

In [61]:
df.drop(columns = ['dummy'],inplace = True)

In [62]:
df.head()

                                     key      city_name  ...  negative positive
job_id                                                   ...
26                None_Ackermanville_213  Ackermanville  ...         2        3
1                      None_Abington_201       Abington  ...         7        9
1                        None_Nemours_72        Nemours  ...         7        0
42      marten_transport_Morton_Grove_42   Morton Grove  ...         9       10
91                       None_Shields_95        Shields  ...         1        7

[5 rows x 9 columns]

In [63]:
df.drop(columns = ['userfeedback'],inplace = True)

In [64]:
df.head()

                                     key      city_name  ...  negative positive
job_id                                                   ...
26                None_Ackermanville_213  Ackermanville  ...         2        3
1                      None_Abington_201       Abington  ...         7        9
1                        None_Nemours_72        Nemours  ...         7        0
42      marten_transport_Morton_Grove_42   Morton Grove  ...         9       10
91                       None_Shields_95        Shields  ...         1        7

[5 rows x 8 columns]

In [65]:
df['total_reviews'] = df['negative']+df['positive']

In [66]:
df.head()

                                     key  ... total_reviews
job_id                                    ...
26                None_Ackermanville_213  ...             5
1                      None_Abington_201  ...            16
1                        None_Nemours_72  ...             7
42      marten_transport_Morton_Grove_42  ...            19
91                       None_Shields_95  ...             8

[5 rows x 9 columns]

In [67]:
df['percentage'] = df['positive']/df['total_reviews']*100

In [68]:
df.head()

                                     key  ... percentage
job_id                                    ...
26                None_Ackermanville_213  ...  60.000000
1                      None_Abington_201  ...  56.250000
1                        None_Nemours_72  ...   0.000000
42      marten_transport_Morton_Grove_42  ...  52.631579
91                       None_Shields_95  ...  87.500000

[5 rows x 10 columns]

In [69]:
dic = {
    "key": "Transportation_and_Logistics_Abbeville_5",
    "recommended_jobs": {
        "0": {
            "city_name": "Abbeville",
            "index": 0,
            "industry": "Transportation and Logistics",
            "job_id": 1,
            "job_title": "Jobs near me - Deliver with Uber Eats",
            "similarity": 0.2484145721
        }}}

In [70]:
dic.keys()

dict_keys(['key', 'recommended_jobs'])

In [71]:
dic['recommended_jobs']

{'0': {'city_name': 'Abbeville',
  'index': 0,
  'industry': 'Transportation and Logistics',
  'job_id': 1,
  'job_title': 'Jobs near me - Deliver with Uber Eats',
  'similarity': 0.2484145721}}

In [74]:
link = "http://143.198.118.108:5080/jobs"

In [75]:
result = requests.post(link, data={'job_id': 5})
json_data = json.loads(result.text)

In [ ]:
json_data

In [91]:
df_percentage = df[['key','positive','negative','percentage']]

In [92]:
df_percentage.head()

                                     key  positive  negative  percentage
job_id
26                None_Ackermanville_213         3         2   60.000000
1                      None_Abington_201         9         7   56.250000
1                        None_Nemours_72         0         7    0.000000
42      marten_transport_Morton_Grove_42        10         9   52.631579
91                       None_Shields_95         7         1   87.500000

In [93]:
for key,value in json_data['recommended_jobs'].items():
  try:
    if df_percentage.iloc[value['job_id']]['percentage']>=36:
      print(df_percentage.iloc[value['job_id']])
  except Exception as e:
    pass

key           None_Abington_201
positive                      9
negative                      7
percentage                56.25
Name: 1, dtype: object
key           None_Abbottstown_217
positive                         7
negative                         7
percentage                      50
Name: 1, dtype: object
key           None_Shields_95
positive                    7
negative                    1
percentage               87.5
Name: 91, dtype: object